'''
TQC+ 程式語言Python 307 乘法表

1. 題目說明:
請開啟PYD307.py檔案，依下列題意進行作答，依輸入值計算n*n乘法表，使輸出值符合題意要求。作答完成請另存新檔為PYA307.py再進行評分。

2. 設計說明：
(1) 請使用迴圈敘述撰寫一程式，要求使用者輸入一個正整數n（n<10），顯示n*n乘法表。

(2) 每項運算式需進行格式化排列整齊，每個運算子及運算元輸出的欄寬為2，而每項乘積輸出的欄寬為4，皆靠左對齊不跳行。

3. 輸入輸出：
輸入說明
一個正整數n（n<10）

輸出說明
輸出格式化的n*n乘法表

範例輸入1
3
範例輸出1
1 * 1 = 1   2 * 1 = 2   3 * 1 = 3   
1 * 2 = 2   2 * 2 = 4   3 * 2 = 6   
1 * 3 = 3   2 * 3 = 6   3 * 3 = 9   

範例輸入2
5
範例輸出2
1 * 1 = 1   2 * 1 = 2   3 * 1 = 3   4 * 1 = 4   5 * 1 = 5   
1 * 2 = 2   2 * 2 = 4   3 * 2 = 6   4 * 2 = 8   5 * 2 = 10  
1 * 3 = 3   2 * 3 = 6   3 * 3 = 9   4 * 3 = 12  5 * 3 = 15  
1 * 4 = 4   2 * 4 = 8   3 * 4 = 12  4 * 4 = 16  5 * 4 = 20  
1 * 5 = 5   2 * 5 = 10  3 * 5 = 15  4 * 5 = 20  5 * 5 = 25  
'''
n = eval(input())
for i in range(1, n + 1):
    for j in range(1, n + 1):
        print(f'{j} * {i} = {j*i:<4}', end="")
    print()